package BaekJoon;

/*
	Question : Дэвид Блейн попросил зрителя задумать два числа.  Затем он попросил перемножить два числа, большие каждого из задуманных на единицу,  
	вычесть из результата сначала одно задуманное число, затем другое, а затем --- их произведение, а полученный результат возвести в 
	$N$-ю степень.
	
	После чего Дэвид внимательно вгляделся в лицо зрителя и правильно назвал получившийся результат. Ваша задача --- повторить фокус Дэвида. По заданному 
	$N$ угадайте получившееся у зрителя число.
	
	input			 
	3
	
	output
	1
	
	Solution : 1. 답은 무조건 1로 떨어짐.
	
*/

public class BaekJoon_18096 {

	public static void main(String[] args) throws Exception {
		// TODO Auto-generated method stub
		System.out.println(1);
	}

}
